data/3-replicas/1-producers/1-consumers/10-throughput/2-trial/producer.txt
2018-11-25 12:13:14, 97599 records sent, 19512.0 records/sec (9.53 MB/sec), 4.9 ms avg latency, 260.0 max latency.
2018-11-25 12:13:19, 97811 records sent, 19558.3 records/sec (9.55 MB/sec), 5.7 ms avg latency, 169.0 max latency.
2018-11-25 12:13:24, 97694 records sent, 19538.8 records/sec (9.54 MB/sec), 41.7 ms avg latency, 542.0 max latency.
2018-11-25 12:13:29, 97714 records sent, 19538.9 records/sec (9.54 MB/sec), 1.5 ms avg latency, 7.0 max latency.
2018-11-25 12:13:34, 97674 records sent, 19530.9 records/sec (9.54 MB/sec), 1.6 ms avg latency, 17.0 max latency.
2018-11-25 12:13:39, 97694 records sent, 19538.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 4.0 max latency.
2018-11-25 12:13:44, 97694 records sent, 19534.9 records/sec (9.54 MB/sec), 1.7 ms avg latency, 18.0 max latency.
2018-11-25 12:13:49, 97706 records sent, 19541.2 records/sec (9.54 MB/sec), 1.6 ms avg latency, 9.0 max latency.
2018-11-25 12:13:55, 88405 records sent, 14622.1 records/sec (7.14 MB/sec), 1.6 ms avg latency, 1520.0 max latency.
2018-11-25 12:14:00, 127404 records sent, 25480.8 records/sec (12.44 MB/sec), 251.2 ms avg latency, 1522.0 max latency.
2018-11-25 12:14:05, 97652 records sent, 19530.4 records/sec (9.54 MB/sec), 1.5 ms avg latency, 5.0 max latency.
2018-11-25 12:14:10, 97694 records sent, 19538.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 18.0 max latency.
2018-11-25 12:14:15, 97703 records sent, 19540.6 records/sec (9.54 MB/sec), 1.6 ms avg latency, 6.0 max latency.
2018-11-25 12:14:20, 97685 records sent, 19533.1 records/sec (9.54 MB/sec), 1.6 ms avg latency, 4.0 max latency.
2018-11-25 12:14:25, 97718 records sent, 19543.6 records/sec (9.54 MB/sec), 1.6 ms avg latency, 17.0 max latency.
2018-11-25 12:14:32, 85112 records sent, 13338.3 records/sec (6.51 MB/sec), 1.6 ms avg latency, 2023.0 max latency.
2018-11-25 12:14:37, 137225 records sent, 27445.0 records/sec (13.40 MB/sec), 402.3 ms avg latency, 2025.0 max latency.
2018-11-25 12:14:42, 97635 records sent, 19527.0 records/sec (9.53 MB/sec), 1.5 ms avg latency, 12.0 max latency.
2018-11-25 12:14:47, 97704 records sent, 19536.9 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-25 12:14:52, 97696 records sent, 19539.2 records/sec (9.54 MB/sec), 1.6 ms avg latency, 17.0 max latency.
2018-11-25 12:14:57, 97702 records sent, 19532.6 records/sec (9.54 MB/sec), 1.6 ms avg latency, 14.0 max latency.
2018-11-25 12:15:02, 97714 records sent, 19542.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 18.0 max latency.
2018-11-25 12:15:07, 97694 records sent, 19534.9 records/sec (9.54 MB/sec), 1.6 ms avg latency, 11.0 max latency.
2018-11-25 12:15:12, 97685 records sent, 19537.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-25 12:15:17, 97683 records sent, 19536.6 records/sec (9.54 MB/sec), 1.6 ms avg latency, 18.0 max latency.
2018-11-25 12:15:22, 97705 records sent, 19537.1 records/sec (9.54 MB/sec), 1.6 ms avg latency, 7.0 max latency.
2018-11-25 12:15:28, 81836 records sent, 13733.2 records/sec (6.71 MB/sec), 1.7 ms avg latency, 1772.0 max latency.
2018-11-25 12:15:33, 132247 records sent, 26449.4 records/sec (12.91 MB/sec), 341.9 ms avg latency, 1774.0 max latency.
2018-11-25 12:15:38, 97719 records sent, 19539.9 records/sec (9.54 MB/sec), 1.6 ms avg latency, 4.0 max latency.
2018-11-25 12:15:43, 97675 records sent, 19535.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 18.0 max latency.
2018-11-25 12:15:48, 97713 records sent, 19538.7 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-25 12:15:53, 97655 records sent, 19531.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 17.0 max latency.
2018-11-25 12:15:58, 97694 records sent, 19534.9 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-25 12:16:04, 79257 records sent, 13520.5 records/sec (6.60 MB/sec), 1.6 ms avg latency, 1807.0 max latency.
2018-11-25 12:16:09, 132947 records sent, 26584.1 records/sec (12.98 MB/sec), 451.8 ms avg latency, 2061.0 max latency.
2018-11-25 12:16:14, 97694 records sent, 19534.9 records/sec (9.54 MB/sec), 1.6 ms avg latency, 7.0 max latency.
2018-11-25 12:16:19, 97714 records sent, 19535.0 records/sec (9.54 MB/sec), 1.7 ms avg latency, 19.0 max latency.
2018-11-25 12:16:24, 97674 records sent, 19534.8 records/sec (9.54 MB/sec), 1.7 ms avg latency, 5.0 max latency.
2018-11-25 12:16:29, 97725 records sent, 19545.0 records/sec (9.54 MB/sec), 1.7 ms avg latency, 15.0 max latency.
2018-11-25 12:16:34, 97664 records sent, 19528.9 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-25 12:16:40, 80077 records sent, 13235.9 records/sec (6.46 MB/sec), 1.6 ms avg latency, 1953.0 max latency.
2018-11-25 12:16:45, 135799 records sent, 27154.4 records/sec (13.26 MB/sec), 407.6 ms avg latency, 1954.0 max latency.
2018-11-25 12:16:50, 97705 records sent, 19541.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-25 12:16:55, 97683 records sent, 19532.7 records/sec (9.54 MB/sec), 1.6 ms avg latency, 19.0 max latency.
2018-11-25 12:17:00, 97679 records sent, 19531.9 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-25 12:17:05, 97701 records sent, 19540.2 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-25 12:17:10, 97675 records sent, 19535.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 17.0 max latency.
2018-11-25 12:17:15, 74276 records sent, 12872.8 records/sec (6.29 MB/sec), 1.9 ms avg latency, 1970.0 max latency.
2018-11-25 12:17:20, 136111 records sent, 27222.2 records/sec (13.29 MB/sec), 406.3 ms avg latency, 1971.0 max latency.
2018-11-25 12:17:25, 97675 records sent, 19535.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 16.0 max latency.
2018-11-25 12:17:30, 97663 records sent, 19524.8 records/sec (9.53 MB/sec), 1.6 ms avg latency, 13.0 max latency.
2018-11-25 12:17:35, 97706 records sent, 19541.2 records/sec (9.54 MB/sec), 1.6 ms avg latency, 17.0 max latency.
2018-11-25 12:17:40, 97662 records sent, 19528.5 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-25 12:17:45, 97714 records sent, 19535.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 16.0 max latency.
2018-11-25 12:17:51, 76827 records sent, 12951.3 records/sec (6.32 MB/sec), 1.6 ms avg latency, 2003.0 max latency.
2018-11-25 12:17:56, 136756 records sent, 27351.2 records/sec (13.36 MB/sec), 417.3 ms avg latency, 2005.0 max latency.
2018-11-25 12:18:01, 97663 records sent, 19532.6 records/sec (9.54 MB/sec), 1.6 ms avg latency, 17.0 max latency.
2018-11-25 12:18:06, 97655 records sent, 19531.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-25 12:18:11, 97717 records sent, 19543.4 records/sec (9.54 MB/sec), 1.6 ms avg latency, 17.0 max latency.
2018-11-25 12:18:16, 97652 records sent, 19526.5 records/sec (9.53 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-25 12:18:21, 97655 records sent, 19531.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 7.0 max latency.
2018-11-25 12:18:27, 79608 records sent, 15524.2 records/sec (7.58 MB/sec), 1.6 ms avg latency, 1053.0 max latency.
2018-11-25 12:18:32, 118221 records sent, 23644.2 records/sec (11.55 MB/sec), 127.2 ms avg latency, 1054.0 max latency.
2018-11-25 12:18:37, 97714 records sent, 19538.9 records/sec (9.54 MB/sec), 1.6 ms avg latency, 17.0 max latency.
2018-11-25 12:18:42, 97666 records sent, 19533.2 records/sec (9.54 MB/sec), 1.6 ms avg latency, 18.0 max latency.
2018-11-25 12:18:47, 97664 records sent, 19532.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 6.0 max latency.
2018-11-25 12:18:52, 97655 records sent, 19531.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 18.0 max latency.
2018-11-25 12:18:57, 84920 records sent, 16470.1 records/sec (8.04 MB/sec), 1.6 ms avg latency, 810.0 max latency.
2018-11-25 12:19:02, 113456 records sent, 22691.2 records/sec (11.08 MB/sec), 419.6 ms avg latency, 1816.0 max latency.
2018-11-25 12:19:07, 97674 records sent, 19534.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 18.0 max latency.
2018-11-25 12:19:09, 7031250 records sent, 19529.893757 records/sec (9.54 MB/sec), 62.13 ms avg latency, 2061.00 ms max latency, 2 ms 50th, 423 ms 95th, 1589 ms 99th, 1953 ms 99.9th.